# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Essential CLI tools
brew "git"
brew "zsh"
brew "curl"
brew "wget"
brew "tree"
brew "jq"
brew "htop"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa" # Better ls
brew "eza" # Modern ls replacement (successor to exa)
brew "tldr" # Better man pages
brew "zoxide" # Better cd
brew "coreutils" # GNU core utilities
brew "trash" # Safe rm replacement
brew "ffmpeg@4" # Video converter
brew "minikube" # Local Kubernetes
brew "pandoc" # Document converter
brew "qrencode" # QR code generator
brew "imagemagick" # Image processing

# Development tools
brew "node"
brew "python@3.12"
brew "uv" # Python package and project manager
brew "go"
brew "rust"
brew "rbenv" # Ruby version manager
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "terraform"
brew "awscli"
brew "google-cloud-sdk" # Google Cloud CLI

# Databases
brew "postgresql@15"
brew "redis"
brew "sqlite"

# Text editing
brew "vim"
brew "neovim"

# Git tools
brew "gh" # GitHub CLI
brew "git-delta" # Better git diff
brew "lazygit" # Git TUI

# Security
brew "gnupg"
brew "ssh-copy-id"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"

# Applications
cask "visual-studio-code"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "1password"
cask "slack"
cask "discord"
cask "spotify"
cask "notion"
cask "obsidian" # Note taking
cask "figma"
cask "postman"
cask "tableplus"
cask "drawio" # Diagrams
cask "setapp" # App store

# Utilities
cask "alfred"
cask "bartender"
cask "cleanmymac"
cask "raycast"
cask "rectangle" # Window management
cask "the-unarchiver"

# Development utilities
cask "iterm2"
cask "sourcetree"
cask "proxyman" # HTTP debugging
cask "dash" # Documentation browser

# Mac App Store apps (requires mas-cli)
brew "mas"
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
mas "Bear", id: 1091189122

# Additional tools installed via other methods:
# - NVM (Node Version Manager): installed via nodejs-install.sh
# - Cargo packages: cargo install cargo-outdated (for Rust development)
# - Python packages: managed via uv or pip per project
